Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:271f272


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # data.http.portal_auth_ping[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "portal_auth_ping" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://auth.zitian.party/ping"
    }

  # helm_release.portal_auth[0] will be created
+ resource "helm_release" "portal_auth" {
      + atomic                     = false
      + chart                      = "oauth2-proxy"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "portal-auth"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://oauth2-proxy.github.io/manifests"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "7.12.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.dashboard will be updated in-place
~ resource "kubernetes_ingress_v1" "dashboard" {
        id     = "platform/kubernetes-dashboard"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "traefik.ingress.kubernetes.io/router.middlewares"    = "platform-portal-auth@kubernetescrd"
                # (3 unchanged elements hidden)
            }
            name             = "kubernetes-dashboard"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.portal_auth_middleware_platform[0] will be created
+ resource "kubernetes_manifest" "portal_auth_middleware_platform" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "portal-auth"
              + namespace = "platform"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://portal-auth-oauth2-proxy.platform.svc.cluster.local/"
                  + authResponseHeaders = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + trustForwardHeader  = false
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "portal-auth"
              + namespace                  = "platform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                  + responseCode     = (known after apply)
                }
              + compress          = {
                  + defaultEncoding      = (known after apply)
                  + encodings            = (known after apply)
                  + excludedContentTypes = (known after apply)
                  + includedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query          = (known after apply)
                  + service        = {
                      + healthCheck        = {
                          + followRedirects   = (known after apply)
                          + headers           = (known after apply)
                          + hostname          = (known after apply)
                          + interval          = (known after apply)
                          + method            = (known after apply)
                          + mode              = (known after apply)
                          + path              = (known after apply)
                          + port              = (known after apply)
                          + scheme            = (known after apply)
                          + status            = (known after apply)
                          + timeout           = (known after apply)
                          + unhealthyInterval = (known after apply)
                        }
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + nodePortLB         = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + domain   = (known after apply)
                              + httpOnly = (known after apply)
                              + maxAge   = (known after apply)
                              + name     = (known after apply)
                              + path     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status         = (known after apply)
                  + statusRewrites = (known after apply)
                }
              + forwardAuth       = {
                  + addAuthCookiesToResponse = (known after apply)
                  + address                  = "http://portal-auth-oauth2-proxy.platform.svc.cluster.local/"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + forwardBody              = (known after apply)
                  + headerField              = (known after apply)
                  + maxBodySize              = (known after apply)
                  + preserveLocationHeader   = (known after apply)
                  + preserveRequestMethod    = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = false
                }
              + grpcWeb           = {
                  + allowOrigins = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentSecurityPolicyReportOnly   = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy       = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + rejectStatusCode = (known after apply)
                  + sourceRange      = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + redis           = {
                      + db             = (known after apply)
                      + dialTimeout    = (known after apply)
                      + endpoints      = (known after apply)
                      + maxActiveConns = (known after apply)
                      + minIdleConns   = (known after apply)
                      + poolSize       = (known after apply)
                      + readTimeout    = (known after apply)
                      + secret         = (known after apply)
                      + tls            = {
                          + caSecret           = (known after apply)
                          + certSecret         = (known after apply)
                          + insecureSkipVerify = (known after apply)
                        }
                      + writeTimeout   = (known after apply)
                    }
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

  # null_resource.casdoor_oidc_apps[0] will be created
+ resource "null_resource" "casdoor_oidc_apps" {
      + id       = (known after apply)
      + triggers = {
          + "dashboard_secret"     = (sensitive value)
          + "github_client_id"     = (sensitive value)
          + "github_client_secret" = (sensitive value)
          + "internal_domain"      = "zitian.party"
          + "kubero_secret"        = (sensitive value)
          + "portal_client_id"     = "portal-gate"
          + "portal_gate_secret"   = (sensitive value)
          + "vault_oidc_secret"    = (sensitive value)
        }
    }

  # random_password.dashboard_oidc_client_secret[0] will be created
+ resource "random_password" "dashboard_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.kubero_oidc_client_secret[0] will be created
+ resource "random_password" "kubero_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.portal_cookie_secret[0] will be created
+ resource "random_password" "portal_cookie_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.portal_gate_client_secret[0] will be created
+ resource "random_password" "portal_gate_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.vault_oidc_client_secret[0] will be created
+ resource "random_password" "vault_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # terraform_data.portal_sso_precheck will be updated in-place
~ resource "terraform_data" "portal_sso_precheck" {
        id     = "a912d9c3-6b86-ef7f-b2b4-f4e56f422964"
      ~ input  = {
          ~ enabled = false -> true
        }
      ~ output = {
          - enabled = false
        } -> (known after apply)
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + default_role       = "reader"
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "name"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = false
    }

  # vault_policy.reader[0] will be created
+ resource "vault_policy" "reader" {
      + id     = (known after apply)
      + name   = "reader"
      + policy = <<-EOT
            # Read-only permission on secrets
            path "secret/*" {
              capabilities = ["read", "list"]
            }
            # List enabled secrets engines
            path "sys/mounts" {
              capabilities = ["read", "list"]
            }
        EOT
    }

Plan: 11 to add, 2 to change, 0 to destroy.

Changes to Outputs:
~ casdoor_apps_managed           = [
      + "portal-gate",
      + "vault-oidc",
      + "dashboard-oidc",
      + "kubero-oidc",
    ]
~ casdoor_oidc_discovery_status  = "disabled" -> (known after apply)
~ portal_auth_url                = (sensitive value)
~ portal_sso_gate_enabled        = (sensitive value)
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> (known after apply)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 11 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`